package com.example.assistant_mtc.screen.about

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel
import com.sogya.mtc.domain.models.AboutDomain

class AboutVM : ViewModel() {
    private val aboutList = arrayListOf(
        AboutDomain("Что такое Военный учебный центр при РТУ МИРЭА?","Военный учебный центр (ВУЦ) — это структурное подразделение РТУ МИРЭА, которое предоставляет возможность пройти военную службу без отрыва от учебы и получить военно-учетную специальность.\n" +
                "\n" +
                "Военный учебный центр при РТУ МИРЭА имеет давнюю историю и традиции, являясь преемником военной кафедры МИРЭА, основанной в 1969 году. \n" +
                "\n" +
                "Студенты ВУЦ проходят обучение параллельно с занятиями в университете, а выпускники ВУЦ направляются на 30-дневные учебные сборы и после аттестации зачисляются в запас, с присвоением первого воинского звания и личного номера."),
        AboutDomain("Военный учебный центр при РТУ МИРЭА проводит подготовку:", "офицеров запаса по семи военно - учетным специальностям,\n" +
                "\n" +
                "сержантов запаса по одной военно - учетной специальности,\n" +
                "\n" +
                "солдат запаса по двум военно - учетным специальностям.\n" +
                "\n" +
                "Обучение в ВУЦ является добровольным, отбор кандидатов проводится на конкурсной основе. Студенты, не прошедшие обучение в ВУЦ, после окончания университета обязаны пройти военную службу по призыву или альтернативную гражданскую службу в соответствии с законодательством Российской Федерации.\n" +
                "\n" +
                "Миссия ВУЦ — укрепление оборонного потенциала России через создание квалифицированных военных кадров. Развитие интеллектуальных, физических и морально — волевых качеств студентов. Воспитание достойных граждан и патриотов.\n" +
                "\n" +
                "Ценности ВУЦ — патриотизм, стремление защищать народ и Отечество. Верность воинскому долгу и присяге. Коллективизм, готовность помочь товарищу в беде, честность, отзывчивость и взаимопомощь. Компетентность, постоянное совершенствование профессиональных навыков сотрудников и учащихся ВУЦ.\n" +
                "\n" +
                "Девиз ВУЦ — через знания к победе.")
    )

    private val aboutLiveData = MutableLiveData<List<AboutDomain>>()


    fun getAboutLiveData(): LiveData<List<AboutDomain>> = aboutLiveData

    init {
        aboutLiveData.value = aboutList
    }
}